IdeaRS.Connections
PlateWidenerData Properties
Compatible with IDEA StatiCa 0.0
The PlateWidenerData type exposes the following members.
Properties
Name | Description
ConnectedPlatePath
 Gets or sets the plate where stiffener is connected to
ExtendedPlatePath
 Gets or sets the extended plate
Height
 Gets or sets the height of the plate
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
Offset
 Gets or sets the distance from the ReferencePlane
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PositionCode
 Gets or sets the position code
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the weld
WidenerShapeCode
 Gets or sets the code of the shape
Width
 Gets or sets the width of the plate
Top
See Also
Reference
PlateWidenerData Class
IdeaRS.Connections.Data Namespace